{
	"items": [
		{
			"img": "media/1.jpg",
			"desc": "“I joined Bronco Brigade because I’m here all the time anyway so I thought, why not. I always come with my mom and it’s better than just sitting here at every game. My mom is the cheer coach so when she comes I have to go, which means I always have to come to every game.” Ryan Watson, 10. (Avery Florence photo)"
		},
		{
			"img": "media/2.jpg",
			"desc": "“I’m an athletic trainer, in choir and theater. My favorite part of training is the people I work with, a mix of all grade levels coming together with a common job, we’re all there to support and make sure our athletes are safe to play. I originally was interested in becoming an athletic trainer because once I graduate, I would like to be a physical therapist, and I thought the background might help. It’s always fun to learn new things, taping wrists and thumbs, making ice bags, and eventually learning to tape ankles.“ Kaelin Franklin, 9. (Emma Elias photo)"
		},
		{
			"img": "media/3.jpg",
			"desc": "“Balancing four extracurricular activities along with a job is extremely difficult at times. Something that makes it easier is ranking all activities by importance and then letting the most important one dictate all the others. For instance, football trumps everything that I do: it clears most conflicting schedules and I use it to help balance the amount of time I spend in other places. Student Council is next important and gets trumped by football, and so on and so forth.” Ty Bentley, 12. (Katelyn Finch photo)"
		},
		{
			"img": "media/4.jpg",
			"desc": "“I’ve been here for 3 years. I coach basketball and came here from Houston after coaching there for 5 years. I was coached by really good coaches and they impacted my life and I realized the difference you can make through coaching. I want my students to know how important time is. Time is right now and you don’t ever get it back, and as we get older, all of us are going to say the same thing, “I wish I had done this thing or this thing”, but you can’t. As a teacher and a coach I want to say to them take advantage of your time, it’s valuable and will affect your future.” (Maija Miller photo)"
		},
		{
			"img": "media/5.jpg",
			"desc": "“We got a new coach this year, Coach Redwine, and I think he has contributed a lot to our 7-0 wins. He makes us do drills, practice footwork, and he pulls us individually for help. This makes me feel like he actually cares and I think it makes me play better.” Abby Hall, 11. (Madison Gonzales photo)"
		},
		{
			"img": "media/6.jpg",
			"desc": "“In January of 2019 I tore my MPFL and I got the surgery to fix it 11 weeks ago on July 24. I was playing basketball with my friends at my old school when it happened. When I jumped up a kid on the other team hit my knee, and I fell to the ground. Now I have to go to physical therapy twice a week for 10 weeks now. I’m excited I’m gonna be cleared for baseball season.” Walker Ballard, 9. (Madison Gonzales photo)"
		},
		{
			"img": "media/7.jpg",
			"desc": "“I moved here 3 years ago from Puerto Rico because my parents didn’t have any job opportunities over there, my aunt convinced us to move to America for a better future. It was hard to move since I was leaving the only thing I knew. It was like I was leaving my comfort zone. I had to say goodbye to my dad and I only get to see him once a year in summer and everything else in my life pretty much changed too. America was definitely different when I got here, I noticed that it’s not family-oriented like Puerto Rico where we would always find time to spend with family instead of friends. Over here work overpowers everything and no one has time for their families which should come first. What I do like about America is the stability that it brings my parents and the tranquility that I see in them being able to provide us a better future.” Jealyanis Ramos-Borges, 11. (Catherine Walworth photo)"
		},
		{
			"img": "media/8.jpg",
			"desc": "“I currently work as a security researcher and developer. I build a lot of hardware extensions and devices. I usually build in hardware debugging devices to allow me to run Java on non-native devices or devices that do not have native devices or devices supported.” Taylor Dettling, 12. (Megan Novak photo)"
		},
		{
			"img": "media/9.jpg",
			"desc": "“I knew we had family served in the Civil War; we had a uniform we keep at my house but never much else. Coach Keel was reading an audio book over the Civil War and heard it mention someone named Lagow. When he told me, I asked my brother about and it and he did some family research since he likes history and stuff. He found a ton on names we were related to. John Westley Hardin, an outlaw gunfighter, Charles B. Lagow, a major Union General, and Sam Houston after he married into the Cherokee Tribe. Those are just the ones I’m for sure about. All of it’s really kinda wild having this History in my family, I don’t really think about it on a daily basis or anything but it is a little inspirational. I’d like to make some kind of ground breaking discoveries too some day maybe as a surgeon or something where my line will be inspired by being related to me too.” Mikayla Lagow, 12th (Seth Miller photo)"
		},
		{
			"img": "media/10.jpg",
			"desc": "“When it was announced Legacy would be District 3 President last year, I wanted to jump up and down with everyone else. I was overwhelmed that all of our hard work had paid off and that we would have a truly important leadership position. Knowing that Legacy was trusted for such a huge responsibility meant a lot to me and Mrs. Cavnar. I’m planning for an amazing year to show that Legacy’s student council has what it takes, and hopefully this is the beginning for our school’s shot at district and state positions. While my workload may be more than what I’m used to, I can’t wait to see how we do and show every school that Legacy is truly a special place for leaders to do what they do best: lead.” Serena Noureddine, 11 (Cooper Certain photo)"
		},
		{
			"img": "media/11.jpg",
			"desc": "“We got Holli four years ago when she was just 12 weeks old. Some family friends of ours had Holli as a puppy but they couldn’t take care of her anymore so we adopted her. I let her ride in my Jeep with me around our property, and we’ll usually just jam out to some music. I think it’s therapeutic for me. Driving gives me time to think, and I enjoy bringing Holli along with me because she’s great company. I know some people say “she’s just a dog,” but she’s so much more than that. I feel like I can be myself around, because she’s my best friend and my cuddle buddy. She’s always there to greet me when I get home and no one else can make me smile as much as she does. Holli means the world to me and I’m so thankful that she’s a part of my family.” Amber Trammell, 11 (Cooper Certain photo)"
		},
		{
			"img": "media/12.jpg",
			"desc": "“I compete in the Special Olympics horseback riding and track. My favorite equestrian events are the trail pattern where you ride through an obstacle course in an outdoor arena and the equitation where you are given commands to instruct your horse on what to do. My proudest award was when I got first place on the trail pattern with my horse Sherlock. I practice horseback riding at Wings of Hope every Monday and Saturday. In track, I run the 100, 200 and the 5k. I won several times in the 100-meter dash.” Grace Medina, 12 (Megan Novak photo)"
		},
		{
			"img": "media/13.jpg",
			"desc": "“Watching kids see something in themselves for the first time, when I knew it was in them, is the best feeling in the world. Self confidence is super important. Kids struggle with that these days. Legacy is an awesome place to coach. Top-notch facilities and equipment. A great principal who loves athletics and is almost at every sporting event. The students at Legacy are awesome. I love kids and sports, I found a way to get paid for it! I never feel like I’m working. That’s why I’m always in a good mood. I love what I do.” Coach Nolan Crowdus (Delayne Fierro photo)"
		},
		{
			"img": "media/14.jpg",
			"desc": "“A couple of my greatest accomplishments this year would be making it so far in this season, farther then I did last year. We had regionals a couples week ago, and I’m one meet away from state and going to Jr Olympics unattached meaning I wasn’t apart of the team anymore. My dad would be my coach. I had three meets to qualify for Jr Olympics, and I just kept on qualifying and made it to the JOs then got to fly to Michigan and compete. Being a part of the track team is a very important thing in my life. I train basically all year round. There’s nothing else I would rather do.” Alika Crawford, 11. (Amara Shanks photo)"
		},
		{
			"img": "media/15.jpg",
			"desc": "“Dancing means the world to me. It’s one of the few things in my life that has stayed consistent and has helped me with more than I can name. I chose dance because it’s something that really sparks my passion and inspires me to look at things in different ways. Dancing makes me feel free and calm, it’s almost therapeutic to be able to dance.” Ashlyn Puzzuole, 11. (Mckenna Collier photo)"
		},
		{
			"img": "media/16.jpg",
			"desc": "“Since I ran a lot when I was younger,  I figured I’d run Cross Country in Middle School and I made a lot of friends there and I stuck with it along side track. The mental challenge of it is the biggest part of running. Most races you’ll already be tired by the first mile and you have to mentally tell yourself you can make it another 2 miles and hold a decent pace. I usually can negative split every mile, meaning that I run each lap actually faster that the last. That way, I get comfortable where I can extend my stride and pick up the pace. At my district race, I was dead last because I ran a 6:00 flat on my first mile, but then I sped up and then ended up finishing 19th out of 52 runners. We lost by only 7 places to Grandbury at District. Knowing we were so close was heart breaking, but we are a pretty young team considering we’re only losing 2 runners since they’re seniors. We have plenty of time to improve and work with each other. I’m excited.” Caleb Kutch, 11th (Seth Miller photo)"
		},
		{
			"img": "media/17.jpg",
			"desc": "“I basically started playing baseball when I was born. My dad had started up a league. I played with him and friends for a long time, until we decided that if I wanted to continue with my career that I’d have to go into more of a competitive setting. This is where I found the Arlington A’s Organization, I’ve been with them for many years now. I worked with them to make it on my team here at legacy, and we’re going from there.” Christian Schlieker, 10. (Madison Gonzales photo)"
		},
		{
			"img": "media/18.jpg",
			"desc": "“I like playing golf because not only is it a physical challenge, but a mental one too. I began playing golf in eighth grade. I started to have an interest in golf once some family friends of mine invited me to come play with them, then after that, I started to take lessons and really started to enjoy the sport. Being on the golf team at school has really taught me how to work as a team, and has let me build many new friendships. Having friends you that have the same interests with is always a bonus too. It’s also nice knowing your teammates always have your back.” Ella Ebert, 9. (Alexa Ebert photo)"
		},
		{
			"img": "media/19.jpg",
			"desc": "“I’ve played softball since as long as I could remember it’s all I have ever done. It’s more than just a game. It has made me who I am today. Committing last year as a freshman was stressful it’s tons of pressure, but it doesn’t bother me.  On top of that, I was out halfway through the season with a huge injury, I tore my ACL. Being back this year is an amazing feeling. I’m so glad I’m back on the field with my teammates and doing what I love” Kelby Robbins, 11. (Amara Shanks photo)"
		},
		{
			"img": "media/20.jpg",
			"desc": "“We’ve played softball since we were three, but we’ve only known each other for seven years. We started playing together when we were in 8U. We were both catchers, so we were always competing for the spot on the field. But then Malia, left, became a center fielder. Ever since then we’ve been best friends. We do everything together anything and everything you could imagine. We can’t go a weekend without each other. We tell each other everything. Now we’re on JV together. It’s been a very eye opening experience. Being with the same girls every single day, you learn a lot of different things about people that you would have never known. You enjoy it though, because your friendships grow. Playing together has made our friendship stronger, we are definitely closer than we ever were before.” Bailee Faram and Malia Calder, 10. (Madison Gonzales photo)"
		},
		{
			"img": "media/21.jpg",
			"desc": "“My dad has always had a passion for soccer, and when I wanted to start playing, he decided to start up a team called the Cheetahs. I have been playing ever since. I took a break from high school soccer not because I wanted to but because I tried out for a prestigious team, the Dallas Texans U-17 Development Academy, which is a program that helps you get exposure to national teams and NCAA coaches. We had a contract that said we were not allowed to play high school soccer, so I thought I would try it out and see how I liked it and how it would benefit me and in the end, it really did and I got a scholarship because of it. I will be attending Sam Houston University next fall on an athletic scholarship. I play goalkeeper for Legacy’s varsity soccer team and I think my favorite part about soccer is the sisterhood behind it. You build such great bonds with like-minded people who strive for the same goals and those relationships last forever. I am so blessed to be able to play with such an amazing group of girls and I cannot wait to see what the future holds for them.” Tatum Krueger, 12. (Kristen Bosecker photo)"
		},
		{
			"img": "media/22.jpg",
			"desc": ""
		},
		{
			"img": "media/23.jpg",
			"desc": "“Tennis has affected my life by creating friendships not only at Legacy, and other schools. Tennis is something I look forward to every day. I feel like playing tennis has made me better at dealing with situations inside and outside of school. Even though it is stressful at times since it takes a lot of time out of my week, between matches and practice I feel like that in the end, being apart of such a great team that is so supportive it is worth it. I also love that the relationships in the team are always good. just like every other sport, there is some tension on occasion but we always make it work.” Orlando Morales, 12. (Grant Gourley photo)"
		},
		{
			"img": "media/24.jpg",
			"desc": "“Last year I participated in JROTC, and it was my life. I joined JROTC because all my friends were in it and all the activities I did was in JROTC. It was such a great experience for me, it taught me discipline and the importance of keeping up my grades. Now I’m an S-5 Public Affairs Officer in JROTC. This year I’m a staff writer for school newspaper. I am also one of the captains of  Legacy’s new step team The Notorious Steppers. Being this active in school teaches me the importance of having my stuff together and I love to have all these responsibilities because now I feel like I’m actually doing something meaningful.” Jada Gnatt, 11. (Amara Shanks photo)"
		},
		{
			"img": "media/25.jpg",
			"desc": "“My mom being a teacher here always brings the best behavior out of me in my classes, because of the fear of being in trouble. As a younger child, I was always thrown into stuff like robotics, Gifted and Talented and etc. After that, I enjoyed it so much that I took every opportunity that was thrown my way. My favorite part of being involved at Legacy is the people I meet, such as when I helped build the set for the High School Musical play, or at the TASC summer workshop. Meeting and hanging out with new people is the best experience.” Clyde Davis, 12. (Landry Pedroza photo)"
		},
		{
			"img": "media/26.jpg",
			"desc": "“I was five years old when I started playing soccer. I didn’t really know I wanted to play until I realized that I was scoring 2-3 goals a game. As a kid, it wasn’t normal to be scoring that often, and everyone was cheering me on. I just grew up and fell in love with the sport. I really enjoy playing on Legacy’s team because I get to play with my best friends everyday, and represent my school all while enjoying the high school experience. I also get in good shape which is good for anyone to exercise, but to exercise while doing something I love makes it a whole lot of more fun. Soccer is something I want to pursue in the future by playing in college for any school that wants to recruit me.“ Conner Contreras, 11. (Delayne Fierro photo)"
		},
		{
			"img": "media/27.jpg",
			"desc": "“At fish camp Lexus Ramos, my mentor, referred me to it [student council] and I joined when freshman year first started. I would never regret joining. I like the family atmosphere. At my first state conference we spent 3 days at the Arlington convention center. We had general assemblies, and we went to Six Flags one night. They had reserved it for all of the students; there was 5,000 people at the conference. Before I was never involved in student council. I still went to the all the meetings and whatever, but I wasn’t really involved until after the conference. I would definitely go again, it was a lot of fun and I learned a lot. We recommend that everybody join StuCo. It’s fun and you’ll learn valuable leadership skills.” Amber Trammel"
		},
		{
			"img": "media/28.jpg",
			"desc": "“I attended Baylor University and graduated with a bachelors in Choral Music Education. I am so excited to be at Legacy. One of my favorite things so far is how positive the students are. They are willing to run laps around the room for energy and breath support and even sing in a forward fold yoga position to negate tension in their necks and shoulders. My primary goal for my classes this year is to create a class culture that promotes confidence and challenges their conceptions of personal and vocal limitations. The Legacy Choirs will work toward singing as musically as possible, meaning they will add vocal colors and timbres, dynamic ranges, emotional and practical interpretations of the text, and musical phrasing to portray a story each time they sing.” Assistant Choir Director Ms. Lafferty. (Mckenna Collier photo)"
		},
		{
			"img": "media/29.jpg",
			"desc": "“As Captain of the Varsity Drill Team, my job consists of many other duties outside of practice. I have to make formations, prepare routines, cut music, make lists for the team, and a lot of other random things. I have to make sure I cover all of the bases when it comes to communication between the officers, team, Mrs. Parlin, and myself. Of course, we work hard during practice, but a lot of people don’t realize how much the Silver Spurs actually do and all the time we put in to be successful. We all rely on each other to create something great. Being Captain has been the best experience I’ve had yet as a member of the drill team. Although I’ve only been able to tweet my team onto the field once, my girls are constantly working hard to improve and push themselves to be their best. I couldn’t ask for a better group of people to lead each and every day.” Ashton Williams, 12. (Zane Hudson photo)"
		},
		{
			"img": "media/30.jpg",
			"desc": "“I plan on playing college football and starting three of the four years. My goal has always been to go to the NFL Combine and have a dominating performance. As far as high school goes I plan on having my breakout year my junior year. I want to break Legacy’s defensive stats and get the most sacks that Legacy has ever seen. Even if I do all of that, I am never satisfied with my performance, I am giving everything I got this last couple of years of football. The ultimate goal for our football team this year is to win a state championship because after Highland Park took it away from us last year, I have never been more passionate for getting anything in my life. I only have one plan right now after high school and it’s going to college and playing football. Even though I have an offer from SMU, I will always be hungry for more.” Taurean Carter JR. 11. (Dawson Daniel Photo)"
		},
		{
			"img": "media/31.jpg",
			"desc": "“I got hurt trying out for All City Kick, a kick team made up of people from different drill teams in the district. At the first practice, I was doing a right fan kick and a prep, but I came down on my ankle and foot too hard. I sprained my ankle and partially tore a muscle in my foot. Being on crutches, I’ve become limited in almost everything I do. It’s hard to do simple things like walking up the stairs at school and at my house, and even making food for myself. At drill team practice, I still learn the dances but I have to sit down, and I mostly just work the StuCo store during class because that’s all I can do. I’m not completely sure when I will be fully recovered, but hopefully really soon. I miss dancing and teaching JV drill at practice.” Chinwe Okafor, 12. (Cooper Certain photo)"
		},
		{
			"img": "media/32.jpg",
			"desc": "“I came from Uganda when I was 12. While I was there, I made small things like wire glasses, a helicopter and some headphones. When I came to America, I got access to all the materials I needed and I really got into robotics. I’ll have friends over to my house every now and then and we’ll work together on little projects in my garage or my room. I’d say it’s better than the school robots since you’re not limited to any materials or time. We once tried to make a robot that could pick up things and then eventually put speakers onto it. The Disco Bot, as we called it, would then serve drinks and play music. I don’t know what it would really be for, but it was fun to just come up with ideas. This is what I love. I make friends with the people who are interested in this type of thing. Have you ever done something where you really just appreciated what you accomplish and want to get better and do it more and more? I walk to Ben Barber every day after school to do robotics. This is what I like. This is what I do. One of the robots I built there was a robotic snake. We built it and actually programmed it to move. I was in a group and we finished the project right before it was due, other groups didn’t even get to program at all. Maybe our head was a little oversized, but it worked and was fun making. I’ve built tons of things over the years though. I’ve made a train, a robot that picked up trash, a bird for my mom for Mother’s Day that flapped and everything, a lawnmower that almost worked, and most recently humanoid one; the arms move, the fingers move, the head moves, the eyes light up, and it even has a hat. Sometimes I get some bad robots that don’t work like my lawnmower while other times I’ve made things I don’t even know what they really are, but I know what the do. If you could make a robot to help you, why not make it?” Alex Smith, 11. (Seth Miller photo)"
		},
		{
			"img": "media/33.jpg",
			"desc": "“I got into slacklining through an old friend of mine on vacation. When I first saw it I was intrigued because I have never seen a slack line, only a tightrope. I like being different and using the slack line I feel helps make me different because I don’t know a lot of people that do it. I also enjoy setting it up and challenging my friends to make it all the way across.” Asher Stuart, 12. (Zane Hudson Photo)"
		},
		{
			"img": "media/34.jpg",
			"desc": "“I started to play when I was five and I haven’t stopped since then.I’ve always known that was what I wanted to play ever since my dad got me started. I played a lot of other sports throughout the years but none of them have compared to softball. It’s my passion and I don’t see myself stopping anytime soon. A few years ago one of my coaches passed away because of cancer. He was like a second dad to me and still inspires me to play every day. Coach Prater is one of the best coaches I’ve ever had because she pushes us to be the best team we can possibly be. I’m an outfielder for high school and I mostly play centerfield. I am eager for this season to start an see what it brings.” Julia Plasket, 11. (Bryce Bell Photo)"
		},
		{
			"img": "media/35.jpg",
			"desc": "“It’s really intimidating to represent such a diverse student body. There’s a lot of people I want to make happy, and there’s a lot of new members that I hope I can inspire. The Student Council environment is very supportive, friendly, productive, and energetic. I think all of our members who come want to be there and enjoy having a voice here and we try and foster a “can do” spirit amongst the council which in turn is making us very proactive. Legacy’s StuCo is unique because of our energy and diverse student population as well as the fact that there are 4 other high schools in our district to pull ideas from. We’ve had a lot of originality as far as looking to our neighboring schools in Mansfield and that makes me really proud as an overseer to know people are taking initiative and implementing what they and the student body wants. I love Student Council and all that comes with leadership and I hope everyone else enjoys it too. I’m having so much fun.“ - Sadie Johnson, 12 (Cooper Certain Photo)"
		},
		{
			"img": "media/36.jpg",
			"desc": "“I joined tennis because my best friend was in it, and I’m really glad I did because I’ve made so many friends from it. The relationships are everything because we all do everything together and have lots of fun. Tennis has made me a better person because it’s taught me how to work with others, how to be a team. I really enjoy hanging out with everyone and the tournaments are fun too.” -Morgan Chambless, 11. (Kaitlyn Menting Photo)"
		},
		{
			"img": "media/37.jpg",
			"desc": ""
		},
		{
			"img": "media/38.jpg",
			"desc": ""
		},
		{
			"img": "media/39.jpg",
			"desc": ""
		}
	]
}