{
  "items": [
    {
      "id": 113,
      "img": "https://media.overstockart.com/optimized/cache/data/frames/FR-650G20X24-1000x1000.png",
      "desc": "test data, please ignore",
      "date": "null"
    },
    {
      "id": 112,
      "img": "https://cdn11.bigcommerce.com/s-4116b/product_images/uploaded_images/brown-frame-3-.jpg",
      "desc": "test data, please ignore",
      "date": "null"
    },
    {
      "img": "media/1.jpg",
      "desc": "“I joined Bronco Brigade because I’m here all the time anyway so I thought, why not. I always come with my mom and it’s better than just sitting here at every game. My mom is the cheer coach so when she comes I have to go, which means I always have to come to every game.” Ryan Watson, 10. (Avery Florence photo)",
      "id": 111,
      "date": "1577253600000"
    },
    {
      "img": "media/2.jpg",
      "desc": "“I’m an athletic trainer, in choir and theater. My favorite part of training is the people I work with, a mix of all grade levels coming together with a common job, we’re all there to support and make sure our athletes are safe to play. I originally was interested in becoming an athletic trainer because once I graduate, I would like to be a physical therapist, and I thought the background might help. It’s always fun to learn new things, taping wrists and thumbs, making ice bags, and eventually learning to tape ankles.“ Kaelin Franklin, 9. (Emma Elias photo)",
      "id": 110,
      "date": "1576648800000"
    },
    {
      "img": "media/3.jpg",
      "desc": "“Balancing four extracurricular activities along with a job is extremely difficult at times. Something that makes it easier is ranking all activities by importance and then letting the most important one dictate all the others. For instance, football trumps everything that I do: it clears most conflicting schedules and I use it to help balance the amount of time I spend in other places. Student Council is next important and gets trumped by football, and so on and so forth.” Ty Bentley, 12. (Katelyn Finch photo)",
      "id": 109,
      "date": "1576044000000"
    },
    {
      "img": "media/4.jpg",
      "desc": "“I’ve been here for 3 years. I coach basketball and came here from Houston after coaching there for 5 years. I was coached by really good coaches and they impacted my life and I realized the difference you can make through coaching. I want my students to know how important time is. Time is right now and you don’t ever get it back, and as we get older, all of us are going to say the same thing, “I wish I had done this thing or this thing”, but you can’t. As a teacher and a coach I want to say to them take advantage of your time, it’s valuable and will affect your future.” (Maija Miller photo)",
      "id": 108,
      "date": "1575439200000"
    },
    {
      "img": "media/7.jpg",
      "desc": "“I moved here 3 years ago from Puerto Rico because my parents didn’t have any job opportunities over there, my aunt convinced us to move to America for a better future. It was hard to move since I was leaving the only thing I knew. It was like I was leaving my comfort zone. I had to say goodbye to my dad and I only get to see him once a year in summer and everything else in my life pretty much changed too. America was definitely different when I got here, I noticed that it’s not family-oriented like Puerto Rico where we would always find time to spend with family instead of friends. Over here work overpowers everything and no one has time for their families which should come first. What I do like about America is the stability that it brings my parents and the tranquility that I see in them being able to provide us a better future.” Jealyanis Ramos-Borges, 11. (Catherine Walworth photo)",
      "id": 107,
      "date": "1574834400000"
    },
    {
      "img": "media/8.jpg",
      "desc": "“I currently work as a security researcher and developer. I build a lot of hardware extensions and devices. I usually build in hardware debugging devices to allow me to run Java on non-native devices or devices that do not have native devices or devices supported.” Taylor Dettling, 12. (Megan Novak photo)",
      "id": 106,
      "date": "1574229600000"
    },
    {
      "img": "media/5.jpg",
      "desc": "“We got a new coach this year, Coach Redwine, and I think he has contributed a lot to our 7-0 wins. He makes us do drills, practice footwork, and he pulls us individually for help. This makes me feel like he actually cares and I think it makes me play better.” Abby Hall, 11. (Madison Gonzales photo)",
      "id": 105,
      "date": "1573624800000"
    },
    {
      "img": "media/6.jpg",
      "desc": "“In January of 2019 I tore my MPFL and I got the surgery to fix it 11 weeks ago on July 24. I was playing basketball with my friends at my old school when it happened. When I jumped up a kid on the other team hit my knee, and I fell to the ground. Now I have to go to physical therapy twice a week for 10 weeks now. I’m excited I’m gonna be cleared for baseball season.” Walker Ballard, 9. (Madison Gonzales photo)",
      "id": 104,
      "date": "1573020000000"
    },
    {
      "img": "media/12.jpg",
      "desc": "“I compete in the Special Olympics horseback riding and track. My favorite equestrian events are the trail pattern where you ride through an obstacle course in an outdoor arena and the equitation where you are given commands to instruct your horse on what to do. My proudest award was when I got first place on the trail pattern with my horse Sherlock. I practice horseback riding at Wings of Hope every Monday and Saturday. In track, I run the 100, 200 and the 5k. I won several times in the 100-meter dash.” Grace Medina, 12 (Megan Novak photo)",
      "id": 103,
      "date": "1572411600000"
    },
    {
      "img": "media/9.jpg",
      "desc": "“I knew we had family served in the Civil War; we had a uniform we keep at my house but never much else. Coach Keel was reading an audio book over the Civil War and heard it mention someone named Lagow. When he told me, I asked my brother about and it and he did some family research since he likes history and stuff. He found a ton on names we were related to. John Westley Hardin, an outlaw gunfighter, Charles B. Lagow, a major Union General, and Sam Houston after he married into the Cherokee Tribe. Those are just the ones I’m for sure about. All of it’s really kinda wild having this History in my family, I don’t really think about it on a daily basis or anything but it is a little inspirational. I’d like to make some kind of ground breaking discoveries too some day maybe as a surgeon or something where my line will be inspired by being related to me too.” Mikayla Lagow, 12th (Seth Miller photo)",
      "id": 102,
      "date": "1571806800000"
    },
    {
      "img": "media/16.jpg",
      "desc": "“Since I ran a lot when I was younger, I figured I’d run Cross Country in Middle School and I made a lot of friends there and I stuck with it along side track. The mental challenge of it is the biggest part of running. Most races you’ll already be tired by the first mile and you have to mentally tell yourself you can make it another 2 miles and hold a decent pace. I usually can negative split every mile, meaning that I run each lap actually faster that the last. That way, I get comfortable where I can extend my stride and pick up the pace. At my district race, I was dead last because I ran a 6:00 flat on my first mile, but then I sped up and then ended up finishing 19th out of 52 runners. We lost by only 7 places to Grandbury at District. Knowing we were so close was heart breaking, but we are a pretty young team considering we’re only losing 2 runners since they’re seniors. We have plenty of time to improve and work with each other. I’m excited.” Caleb Kutch, 11th (Seth Miller photo)",
      "id": 101,
      "date": "1571202000000"
    },
    {
      "img": "media/11.jpg",
      "desc": "“We got Holli four years ago when she was just 12 weeks old. Some family friends of ours had Holli as a puppy but they couldn’t take care of her anymore so we adopted her. I let her ride in my Jeep with me around our property, and we’ll usually just jam out to some music. I think it’s therapeutic for me. Driving gives me time to think, and I enjoy bringing Holli along with me because she’s great company. I know some people say “she’s just a dog,” but she’s so much more than that. I feel like I can be myself around, because she’s my best friend and my cuddle buddy. She’s always there to greet me when I get home and no one else can make me smile as much as she does. Holli means the world to me and I’m so thankful that she’s a part of my family.” Amber Trammell, 11 (Cooper Certain photo)",
      "id": 100,
      "date": "1570597200000"
    },
    {
      "img": "media/10.jpg",
      "desc": "“When it was announced Legacy would be District 3 President last year, I wanted to jump up and down with everyone else. I was overwhelmed that all of our hard work had paid off and that we would have a truly important leadership position. Knowing that Legacy was trusted for such a huge responsibility meant a lot to me and Mrs. Cavnar. I’m planning for an amazing year to show that Legacy’s student council has what it takes, and hopefully this is the beginning for our school’s shot at district and state positions. While my workload may be more than what I’m used to, I can’t wait to see how we do and show every school that Legacy is truly a special place for leaders to do what they do best: lead.” Serena Noureddine, 11 (Cooper Certain photo)",
      "id": 99,
      "date": "1569992400000"
    },
    {
      "img": "media/13.jpg",
      "desc": "“Watching kids see something in themselves for the first time, when I knew it was in them, is the best feeling in the world. Self confidence is super important. Kids struggle with that these days. Legacy is an awesome place to coach. Top-notch facilities and equipment. A great principal who loves athletics and is almost at every sporting event. The students at Legacy are awesome. I love kids and sports, I found a way to get paid for it! I never feel like I’m working. That’s why I’m always in a good mood. I love what I do.” Coach Nolan Crowdus (Delayne Fierro photo)",
      "id": 98,
      "date": "1569387600000"
    },
    {
      "img": "media/15.jpg",
      "desc": "“Dancing means the world to me. It’s one of the few things in my life that has stayed consistent and has helped me with more than I can name. I chose dance because it’s something that really sparks my passion and inspires me to look at things in different ways. Dancing makes me feel free and calm, it’s almost therapeutic to be able to dance.” Ashlyn Puzzuole, 11. (Mckenna Collier photo)",
      "id": 97,
      "date": "1568178000000"
    },
    {
      "img": "media/14.jpg",
      "desc": "“A couple of my greatest accomplishments this year would be making it so far in this season, farther then I did last year. We had regionals a couples week ago, and I’m one meet away from state and going to Jr Olympics unattached meaning I wasn’t apart of the team anymore. My dad would be my coach. I had three meets to qualify for Jr Olympics, and I just kept on qualifying and made it to the JOs then got to fly to Michigan and compete. Being a part of the track team is a very important thing in my life. I train basically all year round. There’s nothing else I would rather do.” Alika Crawford, 11. (Amara Shanks photo)",
      "id": 96,
      "date": "1567573200000"
    },
    {
      "img": "media/20.jpg",
      "desc": "“We’ve played softball since we were three, but we’ve only known each other for seven years. We started playing together when we were in 8U. We were both catchers, so we were always competing for the spot on the field. But then Malia, left, became a center fielder. Ever since then we’ve been best friends. We do everything together anything and everything you could imagine. We can’t go a weekend without each other. We tell each other everything. Now we’re on JV together. It’s been a very eye opening experience. Being with the same girls every single day, you learn a lot of different things about people that you would have never known. You enjoy it though, because your friendships grow. Playing together has made our friendship stronger, we are definitely closer than we ever were before.” Bailee Faram and Malia Calder, 10. (Madison Gonzales photo)",
      "id": 95,
      "date": "1566968400000"
    },
    {
      "img": "media/17.jpg",
      "desc": "“I basically started playing baseball when I was born. My dad had started up a league. I played with him and friends for a long time, until we decided that if I wanted to continue with my career that I’d have to go into more of a competitive setting. This is where I found the Arlington A’s Organization, I’ve been with them for many years now. I worked with them to make it on my team here at legacy, and we’re going from there.” Christian Schlieker, 10. (Madison Gonzales photo)",
      "id": 94,
      "date": "1566363600000"
    },
    {
      "img": "media/19.jpg",
      "desc": "“I’ve played softball since as long as I could remember it’s all I have ever done. It’s more than just a game. It has made me who I am today. Committing last year as a freshman was stressful it’s tons of pressure, but it doesn’t bother me.  On top of that, I was out halfway through the season with a huge injury, I tore my ACL. Being back this year is an amazing feeling. I’m so glad I’m back on the field with my teammates and doing what I love” Kelby Robbins, 11. (Amara Shanks photo)",
      "id": 93,
      "date": "1565758800000"
    },
    {
      "img": "media/24.jpg",
      "desc": "“Last year I participated in JROTC, and it was my life. I joined JROTC because all my friends were in it and all the activities I did was in JROTC. It was such a great experience for me, it taught me discipline and the importance of keeping up my grades. Now I’m an S-5 Public Affairs Officer in JROTC. This year I’m a staff writer for school newspaper. I am also one of the captains of  Legacy’s new step team The Notorious Steppers. Being this active in school teaches me the importance of having my stuff together and I love to have all these responsibilities because now I feel like I’m actually doing something meaningful.” Jada Gnatt, 11. (Amara Shanks photo)",
      "id": 92,
      "date": "1545026400000"
    },
    {
      "img": "media/18.jpg",
      "desc": "“I like playing golf because not only is it a physical challenge, but a mental one too. I began playing golf in eighth grade. I started to have an interest in golf once some family friends of mine invited me to come play with them, then after that, I started to take lessons and really started to enjoy the sport. Being on the golf team at school has really taught me how to work as a team, and has let me build many new friendships. Having friends you that have the same interests with is always a bonus too. It’s also nice knowing your teammates always have your back.” Ella Ebert, 9. (Alexa Ebert photo)",
      "id": 91,
      "date": "1544421600000"
    },
    {
      "img": "media/23.jpg",
      "desc": "“Tennis has affected my life by creating friendships not only at Legacy, and other schools. Tennis is something I look forward to every day. I feel like playing tennis has made me better at dealing with situations inside and outside of school. Even though it is stressful at times since it takes a lot of time out of my week, between matches and practice I feel like that in the end, being apart of such a great team that is so supportive it is worth it. I also love that the relationships in the team are always good. just like every other sport, there is some tension on occasion but we always make it work.” Orlando Morales, 12. (Grant Gourley photo)",
      "id": 90,
      "date": "1543816800000"
    },
    {
      "img": "media/21.jpg",
      "desc": "“My dad has always had a passion for soccer, and when I wanted to start playing, he decided to start up a team called the Cheetahs. I have been playing ever since. I took a break from high school soccer not because I wanted to but because I tried out for a prestigious team, the Dallas Texans U-17 Development Academy, which is a program that helps you get exposure to national teams and NCAA coaches. We had a contract that said we were not allowed to play high school soccer, so I thought I would try it out and see how I liked it and how it would benefit me and in the end, it really did and I got a scholarship because of it. I will be attending Sam Houston University next fall on an athletic scholarship. I play goalkeeper for Legacy’s varsity soccer team and I think my favorite part about soccer is the sisterhood behind it. You build such great bonds with like-minded people who strive for the same goals and those relationships last forever. I am so blessed to be able to play with such an amazing group of girls and I cannot wait to see what the future holds for them.” Tatum Krueger, 12. (Kristen Bosecker photo)",
      "id": 89,
      "date": "1543212000000"
    },
    {
      "img": "media/28.jpg",
      "desc": "“I attended Baylor University and graduated with a bachelors in Choral Music Education. I am so excited to be at Legacy. One of my favorite things so far is how positive the students are. They are willing to run laps around the room for energy and breath support and even sing in a forward fold yoga position to negate tension in their necks and shoulders. My primary goal for my classes this year is to create a class culture that promotes confidence and challenges their conceptions of personal and vocal limitations. The Legacy Choirs will work toward singing as musically as possible, meaning they will add vocal colors and timbres, dynamic ranges, emotional and practical interpretations of the text, and musical phrasing to portray a story each time they sing.” Assistant Choir Director Ms. Lafferty. (Mckenna Collier photo)",
      "id": 88,
      "date": "1542607200000"
    },
    {
      "img": "media/27.jpg",
      "desc": "“At fish camp Lexus Ramos, my mentor, referred me to it [student council] and I joined when freshman year first started. I would never regret joining. I like the family atmosphere. At my first state conference we spent 3 days at the Arlington convention center. We had general assemblies, and we went to Six Flags one night. They had reserved it for all of the students; there was 5,000 people at the conference. Before I was never involved in student council. I still went to the all the meetings and whatever, but I wasn’t really involved until after the conference. I would definitely go again, it was a lot of fun and I learned a lot. We recommend that everybody join StuCo. It’s fun and you’ll learn valuable leadership skills.” Amber Trammel",
      "id": 87,
      "date": "1542002400000"
    },
    {
      "img": "media/26.jpg",
      "desc": "“I was five years old when I started playing soccer. I didn’t really know I wanted to play until I realized that I was scoring 2-3 goals a game. As a kid, it wasn’t normal to be scoring that often, and everyone was cheering me on. I just grew up and fell in love with the sport. I really enjoy playing on Legacy’s team because I get to play with my best friends everyday, and represent my school all while enjoying the high school experience. I also get in good shape which is good for anyone to exercise, but to exercise while doing something I love makes it a whole lot of more fun. Soccer is something I want to pursue in the future by playing in college for any school that wants to recruit me.“ Conner Contreras, 11. (Delayne Fierro photo)",
      "id": 86,
      "date": "1541397600000"
    },
    {
      "img": "media/25.jpg",
      "desc": "“My mom being a teacher here always brings the best behavior out of me in my classes, because of the fear of being in trouble. As a younger child, I was always thrown into stuff like robotics, Gifted and Talented and etc. After that, I enjoyed it so much that I took every opportunity that was thrown my way. My favorite part of being involved at Legacy is the people I meet, such as when I helped build the set for the High School Musical play, or at the TASC summer workshop. Meeting and hanging out with new people is the best experience.” Clyde Davis, 12. (Landry Pedroza photo)",
      "id": 85,
      "date": "1540789200000"
    },
    {
      "img": "media/31.jpg",
      "desc": "“I got hurt trying out for All City Kick, a kick team made up of people from different drill teams in the district. At the first practice, I was doing a right fan kick and a prep, but I came down on my ankle and foot too hard. I sprained my ankle and partially tore a muscle in my foot. Being on crutches, I’ve become limited in almost everything I do. It’s hard to do simple things like walking up the stairs at school and at my house, and even making food for myself. At drill team practice, I still learn the dances but I have to sit down, and I mostly just work the StuCo store during class because that’s all I can do. I’m not completely sure when I will be fully recovered, but hopefully really soon. I miss dancing and teaching JV drill at practice.” Chinwe Okafor, 12. (Cooper Certain photo)",
      "id": 84,
      "date": "1540184400000"
    },
    {
      "img": "media/32.jpg",
      "desc": "“I came from Uganda when I was 12. While I was there, I made small things like wire glasses, a helicopter and some headphones. When I came to America, I got access to all the materials I needed and I really got into robotics. I’ll have friends over to my house every now and then and we’ll work together on little projects in my garage or my room. I’d say it’s better than the school robots since you’re not limited to any materials or time. We once tried to make a robot that could pick up things and then eventually put speakers onto it. The Disco Bot, as we called it, would then serve drinks and play music. I don’t know what it would really be for, but it was fun to just come up with ideas. This is what I love. I make friends with the people who are interested in this type of thing. Have you ever done something where you really just appreciated what you accomplish and want to get better and do it more and more? I walk to Ben Barber every day after school to do robotics. This is what I like. This is what I do. One of the robots I built there was a robotic snake. We built it and actually programmed it to move. I was in a group and we finished the project right before it was due, other groups didn’t even get to program at all. Maybe our head was a little oversized, but it worked and was fun making. I’ve built tons of things over the years though. I’ve made a train, a robot that picked up trash, a bird for my mom for Mother’s Day that flapped and everything, a lawnmower that almost worked, and most recently humanoid one; the arms move, the fingers move, the head moves, the eyes light up, and it even has a hat. Sometimes I get some bad robots that don’t work like my lawnmower while other times I’ve made things I don’t even know what they really are, but I know what the do. If you could make a robot to help you, why not make it?” Alex Smith, 11. (Seth Miller photo)",
      "id": 83,
      "date": "1538974800000"
    },
    {
      "img": "media/29.jpg",
      "desc": "“As Captain of the Varsity Drill Team, my job consists of many other duties outside of practice. I have to make formations, prepare routines, cut music, make lists for the team, and a lot of other random things. I have to make sure I cover all of the bases when it comes to communication between the officers, team, Mrs. Parlin, and myself. Of course, we work hard during practice, but a lot of people don’t realize how much the Silver Spurs actually do and all the time we put in to be successful. We all rely on each other to create something great. Being Captain has been the best experience I’ve had yet as a member of the drill team. Although I’ve only been able to tweet my team onto the field once, my girls are constantly working hard to improve and push themselves to be their best. I couldn’t ask for a better group of people to lead each and every day.” Ashton Williams, 12. (Zane Hudson photo)",
      "id": 82,
      "date": "1538370000000"
    },
    {
      "img": "media/30.jpg",
      "desc": "“I plan on playing college football and starting three of the four years. My goal has always been to go to the NFL Combine and have a dominating performance. As far as high school goes I plan on having my breakout year my junior year. I want to break Legacy’s defensive stats and get the most sacks that Legacy has ever seen. Even if I do all of that, I am never satisfied with my performance, I am giving everything I got this last couple of years of football. The ultimate goal for our football team this year is to win a state championship because after Highland Park took it away from us last year, I have never been more passionate for getting anything in my life. I only have one plan right now after high school and it’s going to college and playing football. Even though I have an offer from SMU, I will always be hungry for more.” Taurean Carter JR. 11. (Dawson Daniel Photo)",
      "id": 81,
      "date": "1516082400000"
    },
    {
      "img": "media/36.jpg",
      "desc": "“I joined tennis because my best friend was in it, and I’m really glad I did because I’ve made so many friends from it. The relationships are everything because we all do everything together and have lots of fun. Tennis has made me a better person because it’s taught me how to work with others, how to be a team. I really enjoy hanging out with everyone and the tournaments are fun too.” -Morgan Chambless, 11. (Kaitlyn Menting Photo)",
      "id": 80,
      "date": "1515477600000"
    },
    {
      "img": "media/34.jpg",
      "desc": "“I started to play when I was five and I haven’t stopped since then.I’ve always known that was what I wanted to play ever since my dad got me started. I played a lot of other sports throughout the years but none of them have compared to softball. It’s my passion and I don’t see myself stopping anytime soon. A few years ago one of my coaches passed away because of cancer. He was like a second dad to me and still inspires me to play every day. Coach Prater is one of the best coaches I’ve ever had because she pushes us to be the best team we can possibly be. I’m an outfielder for high school and I mostly play centerfield. I am eager for this season to start an see what it brings.” Julia Plasket, 11. (Bryce Bell Photo)",
      "id": 79,
      "date": "1513663200000"
    },
    {
      "img": "media/35.jpg",
      "desc": "“It’s really intimidating to represent such a diverse student body. There’s a lot of people I want to make happy, and there’s a lot of new members that I hope I can inspire. The Student Council environment is very supportive, friendly, productive, and energetic. I think all of our members who come want to be there and enjoy having a voice here and we try and foster a “can do” spirit amongst the council which in turn is making us very proactive. Legacy’s StuCo is unique because of our energy and diverse student population as well as the fact that there are 4 other high schools in our district to pull ideas from. We’ve had a lot of originality as far as looking to our neighboring schools in Mansfield and that makes me really proud as an overseer to know people are taking initiative and implementing what they and the student body wants. I love Student Council and all that comes with leadership and I hope everyone else enjoys it too. I’m having so much fun.“ - Sadie Johnson, 12 (Cooper Certain Photo)",
      "id": 78,
      "date": "1513058400000"
    },
    {
      "img": "media/33.jpg",
      "desc": "“I got into slacklining through an old friend of mine on vacation. When I first saw it I was intrigued because I have never seen a slack line, only a tightrope. I like being different and using the slack line I feel helps make me different because I don’t know a lot of people that do it. I also enjoy setting it up and challenging my friends to make it all the way across.” Asher Stuart, 12. (Zane Hudson Photo)",
      "id": 77,
      "date": "1512453600000"
    },
    {
      "img": "media/40.jpg",
      "desc": "“I was new to the school district and knew absolutely no one. I started making friends through football and student council. My first year in student council, I was only a member that who went to the meetings and clubs to get to know people and make some bonds. I’m President of the Sophomore class this year and plan on keeping it up my junior year too. I would never skip out on StuCo, I’ve grown to love it and would miss it too much. I’d love to be student body president some day. I think I could put a lot of heart and soul into the school. I’ll be ready and excited once I get the opportunity during my senior year.” Michael Cooper, 10 (Seth Miller Photo)",
      "id": 76,
      "date": "1511848800000"
    },
    {
      "img": "media/39.jpg",
      "desc": "“In order to get Fishing Club running, we had to go through a good amount of people. To get the club approved, we had to set up a meeting with Dr. Butler. Once she approved it we had to find a teacher that would be our sponsor. Afterward, we had to fill out the paperwork through Texas High School Bass Association to get registered as a high school team and pay entries,” Austin Van Zandt(left), 12. “We started the Legacy Fishing Club to share our passion for fishing with others and so we could show off our skills while competing in high school bass tournaments,” Logan Taylor (right), 12 (Tori Greene Photo)",
      "id": 75,
      "date": "1511244000000"
    },
    {
      "img": "media/38.jpg",
      "desc": "“I started playing when I was about 4 years old and my family is just a big baseball family, so once I started playing I just started to fall in love with it and kept playing it. It was always my goal to go to college and to play baseball, but Texas Tech has been my #1 school since I was a little kid, so it’s always been a dream of mine to go there. I like Lubbock and I like the school in general, but just the coaches and the baseball team were really nice and I just thought it’d be the best place for me. My family was really supportive and my dad was probably the most supportive because he’s always wanted me to go play college baseball and he likes Tech. Committing to Tech takes some stress off of my shoulders because then I don’t have to worry about trying to impress college coaches or anything, but I just try to keep the same mindset every day and continue to work hard.” Nate Rombach, 11 (Courtesy photo)",
      "id": 74,
      "date": "1510639200000"
    },
    {
      "img": "media/41.jpg",
      "desc": "“I studied at the University of Texas at Arlington for my master’s degree. I got assigned Timberview High School to do my student teaching; at the time Legacy was being built. Both of my sons lived in Legacy’s school zone so I decided to get a job at the same school as my kids, so I could be with them. I started teaching geometry and I also was the cheer sponsor for the freshman girls. When Lake Ridge open the district had a rule, ’‘last come first go” which meant that the last teachers that got a job a Legacy had to go teach at Lake Ridge. One of those teachers was the Pre-AP Algebra Two teacher. I got the offer to teach Pre-AP so I accepted and did all the proper training to teach the class. About nine years ago on my second year teaching at Legacy, one of my student’s mom that worked as a teacher for the district approach me and asked me if I could teach SAT math for the summer. She was in charge of the summer program for SAT, so they called me and said they were short of math teachers. Since then I have been involved in teaching it and over the years of experience, I have become an expert on it. When students come in and ask me for help it gives me goosebumps because I just love to help kids to get into their dream school. About a couple of years ago the district decided to create the PSAT team which helps the district to produce national merit semifinalist. Since I was involved with the district it made sense to teach the class here on campus. What I love about Legacy is the positive environment that the kids have. When a new teacher comes here teach they ask me “tell me something good about the school.” I always tell the kids, they are always positive and ready to learn. If a student needs help with college research or SAT/ACT related questions they can always come to me at V302. Algebra teacher Julie Gross (Yibran Franco Photo)",
      "id": 73,
      "date": "1510034400000"
    },
    {
      "img": "media/37.jpg",
      "desc": "“I started playing volleyball when I was 6 years old. I decided to play in high school because I have always done it, so it would be foreign not to play. I enjoy volleyball because I can be crazy and be myself. It’s also an outlet for everything that goes on in life. I’m a captain and I only play defense because I’m too short to play anything else. I feel my energy and positivity are a necessity in the sport because of hardships that can happen. The hardest part of volleyball would be losing because it’s hard to accept defeat, but you have to in order to work and build for something better. This year working together has not been an issue, we have come together and grown together. It would be very hard to work individually, we need the team as a whole to work together. The hardest part is when an individual player is doing bad, it’s hard for them mentally, but they never really break away from the team. The friendships that I have made have lasted throughout all of high school and the new girls coming in have helped add to the family away from family. It’s great because we always have someone to lean on.” Katelyn Allen, 12 (Kristen Bosecker photo)",
      "id": 72,
      "date": "1509426000000"
    },
    {
      "img": "media/42.jpg",
      "desc": "“All my life I’ve been singing, but I started performing when I was in second grade. I joined choir two years ago when I moved from Michigan to Texas. Choir helped me find a family I didn’t know I had. They are all amazing and kind people who live music as much as I do. Singing is my everything. Any type of emotion you have, there’s a song for it. There isn’t always the words, so music is always been my comfort. My mother is the reason I started singing actually. She was a huge singer when I was growing up and my family has always loved music, even though most of them are tone depth. Ideally, I would love to be a singer and get to perform on a big stage, but realistically, it’s not a good market to go into. I’ve decided I want to go to college for music education to become a choir director which is always music so I can still have it in part of my life. When I grow older to have kids I hope I can incorporate music into their lives to carry on the love for music to the next generation.” Sarah Weissend,10 (McKenna Collier Photo)",
      "id": 71,
      "date": "1508821200000"
    },
    {
      "img": "media/43.jpg",
      "desc": "“People can’t always tell that I’m Punjabi. I love my culture; I embrace it. It’s a very big part of my life and I’m not afraid to show that to people. At school, I have to try to come across as normal, but as a Punjabi– we’re very loud and proud– normalcy doesn’t really matter because we’re all about having fun. My favorite part about being punjabi is that it’s unique. People don’t normally know about it and they’re usually interested in learning more about it.” Avleen Kang, 11 (Kassidy Duncan Photo)",
      "id": 70,
      "date": "1508216400000"
    },
    {
      "img": "media/44.jpg",
      "desc": "“Reese’s Puffs are probably the best cereal that was ever made. I pretty much love them. Every week, a couple volleyball teammates and I go out to eat before the game and then we go to Walmart to get our cereal which is basically our pregame snack. Some people probably think it’s weird that I carry a whole box of family sized cereal around with me during the game but others might think it’s comical. I’ve always grown up to be positive and to have a happy perspective on life. I’m pretty much always corky. When I am at events, I feel really happy because I enjoy watching the games and Reese’s Puffs basically top it off. Eating is pretty great and it makes a lot of people happy. If you eat, you’re happy all the time which is how I live.” Alexandria Gentry, 9 (Holden Ross Photo)",
      "id": 69,
      "date": "1507611600000"
    },
    {
      "img": "media/45.jpg",
      "desc": "“Since I am a senior, I am looking forward to getting more involved with the team and possibly, during the spring, going to state. I play tennis because in my younger days I wasn’t the biggest so I couldn’t play football and baseball and all of that so tennis kind of gave me the chance of being the smallest but I could still compete at a high level. I think the determination of wanting to get better makes a good tennis player and not just going out and hitting but trying to improve your strengths as well as your weaknesses. It helps me get more self-control like getting angry and keeping my calm even in a bad situation. Like even with school work, if I get mad at what I am doing I can calm down faster than usual.” Josh Lopez, 12 (Ryland Mallett Photo)",
      "id": 68,
      "date": "1507006800000"
    },
    {
      "img": "media/46.jpg",
      "desc": "“Everyone was constantly asking me to do their henna. At lunch, in class, after school, I even did henna on Ms.Bennett. So finally I just decided to make a club. Everyone loves henna and I would love to teach them how to do it themselves!” Heba Zakaria, 12 (Jada Succes photo)",
      "id": 67,
      "date": "1489467600000"
    },
    {
      "img": "media/47.jpg",
      "desc": "“Dance brings a funness in my life and I feel free. It has introduced me to many girls that I call my sisters.” Jessica Newcomb, 11 (Chloe Stell photo)",
      "id": 66,
      "date": "1488866400000"
    },
    {
      "img": "media/48.jpg",
      "desc": "“Makeup lets me turn myself into anybody I want to be. I could do my makeup like a prom queen, or I could make myself ooze blood like a zombie. The more blood the merrier is what my mom always says.” Peyton Pimlott, 11 (Chloe Stell photo)",
      "id": 65,
      "date": "1488261600000"
    },
    {
      "img": "media/49.jpg",
      "desc": "“My freshmen year I was pulled into debate by my neighbor’s daughter, who was on the LD team. She told me to go check out Mr. Ritz, and I thought he was funny. The thing I love most about debate is the academic competitiveness and being able to flex my intellect. I have definitely learned research skills from debate. I’ve had some pretty legit research papers that I’ve written, even for my TCC and AP classes; it all comes from debate. I pull my evidence that I use for debate and use them in those papers. I have to put countless hours of research, speaking drills, pretty much giving up my summers to go to camp and get better, and of course time and effort. I want people to know that being part of a debate team gives you a big opportunity to get to know people on more of an intellectual level where you get a professional rapport. You can have a different set of views from someone without hating them for it. I can definitely see myself doing debate long term. I’m definitely going to work summer institutions to help young debaters get better, not that I’m that great.” Ben Speigner, 12 (Colbi Branch photo",
      "id": 64,
      "date": "1487656800000"
    },
    {
      "img": "media/50.jpg",
      "desc": "“I started baseball when my Dad first took me to a Ranger baseball whenever I was 3, and I have loved it ever since. I kept playing baseball because my Dad started teaching how to throw correctly, catch the ball in the outfield, and swing. I just kept working hard at it and I love the sport. I want to take my career in baseball as far as I can even if that means going professional. Which is what I hope I can do.” Jadon Ewing, 11 (Dalton Mix photo)",
      "id": 63,
      "date": "1487052000000"
    },
    {
      "img": "media/51.jpg",
      "desc": "“I was a trainer at Legacy for all four years of my high school career. I loved being able to help out the athletes and learn things from the other trainers. My favorite part of training was being able to tape up ankles. It was fun to learn, practice and become an expert at taping. Track season was my favorite sport to train because we made some many great memories and I made some of my closest friends through track. I come back to the games because I miss training and it makes me happy to see all the old faces. I still help out if the players need it; I’ll always be a trainer for Legacy.” Erin McTighe, former student (Megan Bell photo)",
      "id": 62,
      "date": "1486447200000"
    },
    {
      "img": "media/52.jpg",
      "desc": "“I’ve never felt so comfortable around a group of girls for as long as I have been cheering. They make me feel at home and always push me and make me strive to get better with everything I do.” Mckenna Calvert, 11 (Zane Hudson photo)",
      "id": 61,
      "date": "1485842400000"
    },
    {
      "img": "media/53.jpg",
      "desc": "“I’ve loved theater since I was a little kid. I tried doing something else, and I wasn’t happy. I worked as a professional director and actor but that void wasn’t fulfilled. I went back to school and decided to teach, and I remembered I loved my teachers. I remember the impact they had on me.” Ms. Heather Alverson (Abby Belea photo)",
      "id": 60,
      "date": "1484632800000"
    },
    {
      "img": "media/54.jpg",
      "desc": "“When my life seems to be spiraling and I start to get stressed, I just sit down, take a deep breath, and play away. I feel in control in the moments when I’m playing alone.” Allysa Arana, 12 (Mia Trahan photo)",
      "id": 59,
      "date": "1484028000000"
    },
    {
      "img": "media/55.jpg",
      "desc": "“I was in seventh grade when I realized that I had scoliosis. Before then it hadn’t really been noticeable. By the time freshman year started, my back was at a 52° curve, meaning I was eligible to have a surgery to correct it, which ended up happening in November of 2015. The doctors placed two titanium rods on either side of my spine and secured them with 1-2 inch screws. Now, my back is mostly fixed, but because the original degree of curve was so high, there is still about a 10° curve. The full recovery time from the surgery is hard to pinpoint, but I should be able to resume everything I had been able to do before the surgery, like ride roller coasters, with no trouble in a little over a year.” Danielle Morgan, 10 (Kassidy Duncan photo)",
      "id": 58,
      "date": "1483423200000"
    },
    {
      "img": "media/56.jpg",
      "desc": "“I’ve been in debate for two years now. Last year I was a novice, and this year I’m a varsity member. I joined debate because I really wanted to participate in an activity that would help me in my speech and comprehension and let me practice thinking quickly on my feet. Mr. Ritz is such an amazing teacher. He goes to tournaments almost every Saturday with students from 5 a.m. to almost 10 p.m. at night. I definitely wouldn’t have joined debate again if I hadn’t thought he was such a great teacher in Intro to Debate.” Katlin Nguyen, 10 (Ellen Brutsché photo)",
      "id": 57,
      "date": "1482818400000"
    },
    {
      "img": "media/57.jpg",
      "desc": "“Throughout the season there’s always ups and downs but fortunately the team always keeps a positive attitude and rarely gets down on each other. It’s like one big family.” Garrett Ferguson, 11 (Zane Hudson photo)",
      "id": 56,
      "date": "1482559200000"
    },
    {
      "img": "media/58.jpg",
      "desc": "“I was interested in chemistry since the eighth grade. My teacher let me take home some chemicals, and I used them to do some chemical experiments in my basement. I made oxygen and hydrogen. When I went to college my degree was in environmental sciences, and I thought being in a lab would be too boring. I spent 16 years in my own business before I became a teacher. In the business, we analyzed fuels, inspected construction and materials and exploratory drilling.” Mr. Johnathan Szostek (Kristen Bosecker photo)",
      "id": 55,
      "date": "1482213600000"
    },
    {
      "img": "media/59.jpg",
      "desc": "“I like making the Weird faces because my freshman year my yearbook picture was so bad I laughed at it. So, I decided it was better to intentionally take a bad picture and laugh with myself than unintentionally and laugh at myself.” Garrett Shadwick, 12 (Emary Skoczlas photo)",
      "id": 54,
      "date": "1481954400000"
    },
    {
      "img": "media/60.jpg",
      "desc": "“I started off doing cross country a couple years ago. When I got tired of it, I tried something new, something more fast pace. I joined track at the recommendation of my cross country coach, coach Beckler. I do miss my friends from cross country, but I love my new friends in track as well. I always tell myself ‘What’s the point of doing anything if you’re not surrounded by the people you love?’” Gabbi Lowry, 11 (Hunter Roberts photo)",
      "id": 53,
      "date": "1481608800000"
    },
    {
      "img": "media/61.jpg",
      "desc": "“I started golf the end of my freshmen year, we had about two months of school left. I have always been involved in at least one sport. For a long, time I was really into running and gymnastics. I would probably still be doing that today if my hip wasn’t twisted. My doctor told me if I kept running on my hurt hip, I would need a hip replacement when I am 30. For about eight months I wasn’t doing a sport because I wasn’t sure what I could do that wouldn’t hurt my hip. Then my biology teacher, who was also the girl’s golf coach, saw potential in me and told me I should try to play golf. Ever since then I have been playing golf. I have met some amazing people through this sport, all whom I look up. Golf has impacted my life by teaching me to never give up and to always believe in myself.” Macie Rowell, 10 (Kaitlyn Menting photo)",
      "id": 52,
      "date": "1481004000000"
    },
    {
      "img": "media/62.jpg",
      "desc": "“I feel happy, grateful, and blessed that I was able to be in the position of Varsity Senior Lieutenant. What I enjoy most is teaching and learning from an amazing group of people.” Rakiyah Graham,12 (Chyna Moore photo)",
      "id": 51,
      "date": "1480485600000"
    },
    {
      "img": "media/63.jpg",
      "desc": "“I’ve been working at Legacy as a receptionist for nine years, and I absolutely love it! I’ve fallen in love with my job. It’s literally my life!” - Mrs. Jessica Steward (Chyna Moore photo)",
      "id": 50,
      "date": "1479794400000"
    },
    {
      "img": "media/64.jpg",
      "desc": "“I have been playing poker since I was about 8. I grew up in a poker family. It’s serious and I pay up to $2,000 for a tournament when I can lose in 5 minutes. I play with friends and strangers. The biggest tournament I played in had 3,000 people and I got 5th place. I’m ranked the 57th woman in the world. When I’m in season, I go once a month but out of season I usually go twice a month.” -Ms. Krissi McFarland (Kristen Bosecker photo)",
      "id": 49,
      "date": "1479189600000"
    },
    {
      "img": "media/65.jpg",
      "desc": "“I really love drill team because you can dance and be serious and also have fun at the same time. I joined drill team because when my brother used to play football for legacy, I would always see them perform during halftime and they were all so pretty and I wanted to be like them. I’ve made friendships that will probably last a lifetime. Drill team has made me a better person and leader. Being on the team has definitely brought me out of my shell.” -Sophie Ellis (Kaitlyn Menting photo)",
      "id": 48,
      "date": "1478584800000"
    },
    {
      "img": "media/66.jpg",
      "desc": "“I wasn’t good at anything as a child and my parents tried putting me in a bunch of activities. Eventually, they thought “let’s try horses”, and then they did and I fell in love with it. I started riding here [Golden Gaits] 11 years ago, and I’ve been working here for the past five years. Working with horses is so amazing because they are such amazing and cool creatures. They are so much different than any other creature and you just form a special bond with them.” Hannah Morrell, 12 (Ellie Brutsche photo)",
      "id": 47,
      "date": "1477976400000"
    },
    {
      "img": "media/67.jpg",
      "desc": "“I grew up with my dad drinking alcohol; it was never something weird. I’d always see two or three empty beer cans shoved between the driver’s seat and the console of his pickup truck. That was normal to me. In about seventh grade, I was sitting on the couch with my sister  and my dad walked in and said ‘I don’t know how to put this, so I’m just gonna say it: I’m an alcoholic.’ From there, he attended AA meetings and we watched him struggle. Later on, he was driving my brother to my sister’s soccer game and my brother frantically called my mom and I from the car and started screaming to us, ‘Dad’s drunk; he’s gonna kill us. We’re gonna get killed.’ My dad had relapsed but hadn’t told anyone. We made him pull over and took him to his AA group and let somebody else drive him home while we went to the game. The car my dad and brother were in is the car I drive now, and it’s really hard for me to have to deal with that every day. Eventually, we got through that and his relapses, and now he’s two years sober and still working hard to overcome this sickness. It’s insane to see the difference between the man he was and the man he is now that he quit. I have reservations towards alcohol because addiction is everywhere in my family, whether it be in alcohol, video games, or in my case, Dr. Pepper.  When [adults] say not to drink alcohol, I understand because I’ve seen how it can destroy a person.” Kelsi Davis, 11 (Kassidy Duncan photo)",
      "id": 46,
      "date": "1477285200000"
    },
    {
      "img": "media/68.jpg",
      "desc": "“I love having toys in the classroom because  I have students that’ll pick up a toy and wind up asking ‘how does this work, how does it do this’ and that gives me a chance to talk about physics and play with toys; and that’s like two of the best things you can do” Mr. John Davis (Megan Bell photo)",
      "id": 45,
      "date": "1463634000000"
    },
    {
      "img": "media/69.jpg",
      "desc": "“My mom is honestly one of my best friends, like I tell her everything. It used to annoy me having to come to school with my mom when I couldn’t’ drive because we had to be at school so early, but now that I can drive it’s not annoying anymore. It’s always interesting to hear from my friends what crazy stories she’s been telling or what she does in class because my mom is crazy. Me and my mom are really close and we are a lot alike.” Natalie Burkett, 11 (Nikole Dimanche photo)",
      "id": 44,
      "date": "1462942800000"
    },
    {
      "img": "media/70.jpg",
      "desc": "“Ben and I been dating for about 2 and a half years. The beginning this year’s tournament season we became doubles partners. We play terrible together and we fight a lot while playing, but good thing about playing together is that we get to spend the whole day with each other which is pretty fun.” Kelsey Sanford, 11 (Emary Skoczlas)",
      "id": 43,
      "date": "1461128400000"
    },
    {
      "img": "media/71.jpg",
      "desc": "“I carry this flag because I am tired of people disrespecting and killing the people who respect us most, the people who lay down their lives for us.” Austin Spencer, 11 (Dalton Mix photo)",
      "id": 42,
      "date": "1459486800000"
    },
    {
      "img": "media/73.jpg",
      "desc": "“When we're on the field we don’t treat each other as siblings we treat each other as if we were friends playing on the football field together which I think had also helped us with building our relationship as brothers. I love my brother and I enjoy playing with him.” Clayton Franks, 10 (Emary Skoczlas photo)",
      "id": 41,
      "date": "1453960800000"
    },
    {
      "img": "media/74.jpg",
      "desc": "“It (tearing my ACL) is disappointing, especially being my senior year, but I know I am still recognized as part of the team and that I am able to still help out. It just makes me realize that in the long run I will be stronger than I was before, both in volleyball and life.” Lexi Contos, 12 (Madi Fielding photo)",
      "id": 40,
      "date": "1450332000000"
    },
    {
      "img": "media/75.jpg",
      "desc": "“That was good. Now squeeze your butt and do it again.” Coach Watson, Varsity Cheer Coach (Liesl Prater photo)",
      "id": 39,
      "date": "1446444000000"
    },
    {
      "img": "media/76.jpg",
      "desc": "“I just started doing cheer this year and I was lucky enough to make varsity. I have learned that I love cheer and [joining] was the best decision that I made” Tamika Sanders, 11 (Tapanga Perrin photo)",
      "id": 38,
      "date": "1445230800000"
    },
    {
      "img": "media/77.jpg",
      "desc": "“The University of Texas started recruiting me for my soccer talent during my eighth grade year. It was a little bit overwhelming for me being a thirteen year old. I liked the idea of my school getting paid for, doing something I love, so I decided to commit to the University of Texas in the spring of my sophomore year. I feel very blessed to have this opportunity and don’t want to take it for granted.” - Peyton McGee,11 (Megan Bell photo)",
      "id": 37,
      "date": "1443762000000"
    },
    {
      "img": "media/78.jpg",
      "desc": "“I decided to start working here because I want to work in the medical field and I thought that this would be a good stepping stone for me. My mom works here and she told me that they needed someone to clean and help the CNA’s so I decided to go for it. I really enjoy working with the residents here; I like being able to help them and that I am able to be active in their lives.” M'Kayla Harry, 12 (Natalie Scifres photo)",
      "id": 36,
      "date": "1431061200000"
    },
    {
      "img": "media/79.jpg",
      "desc": "“I started baseball at the age of 4, since then baseball has become my passion. Knowing that this is my first year in high school, I was looking forward to be playing with one of the top high school baseball teams in Texas.” Toby Griffin, 9 (Allyson Salazar photo)",
      "id": 35,
      "date": "1431061200000"
    },
    {
      "img": "media/80.jpg",
      "desc": "“Being a quarterback is challenging since all the pressure is all on you. You have to be the most disciplined leader on the team.” Marc Trevino, 9 (Allyson Salazar photo)",
      "id": 34,
      "date": "1431061200000"
    },
    {
      "img": "media/81.jpg",
      "desc": "“I felt stressed before I played my solo in movement three of Symphonic Metamorphosis, because band puts so much stress on me. It feels like I always need to have perfect tone.” Isabel Flores,10 (Shayli Hollinger photo)",
      "id": 33,
      "date": "1430888400000"
    },
    {
      "img": "media/82.jpg",
      "desc": "“Sometimes It’s difficult to have a high school relationship, because schedules always collide when both of you are involved in time consuming activities.” Jaqueline Lum, 10 (Shayli Hollinger photo)",
      "id": 32,
      "date": "1430888400000"
    },
    {
      "img": "media/83.jpg",
      "desc": "“I love doing Guard because when I perform I am able to show people how much work I’ve put into something. Plus it gets me out of P.E.” Justin Lum,12 (Shayli Hollinger photo)",
      "id": 31,
      "date": "1430888400000"
    },
    {
      "img": "media/84.jpg",
      "desc": "“It was the first Sunday of Thanksgiving break. Jacob Gray, Stephen Gutierres, & I were just hanging out in my shop and we were about to go inside. Jacob was messing around on this hitting machine I have out there. I walked behind Jacob to a shelf who had the bat in between his legs. I turned around to talk to Stephen then next thing I know I hear ringing in my ears. I was not sure what had hit me. I thought I was hit by lighting for a second until I realized I was inside. I’m pretty sure I passed out but it wouldn’t have been for very long because I remember waking up on the floor next to a tool box. Stephen helped me up while Jacob went to go get my mom. She wasn’t sure if I was going to need stitches so she had to go wake up my dad. He looked at it for maybe 5 seconds and said, ‘He’s definitely going to need them’. I get to the hospital and they took me straight back to a room. Thirty minutes later a nurse, came in and said that I was going to need a CAT scan. After they took the scan of my head, they took me back to the room the doctor said, ‘I’ve got some bad news. He’s got three fractured bones and is most likely going to need surgery.’ I was praying that I wasn’t going to need surgery because I was really scared about everything that was happening. So, I went into surgery and they made a cut where the scar is today to put the first plate in. Then, they made another on the inside of my mouth to get the other plate in. Everything went fine with the surgery, but I had to sleep on the right side of my face and be on a soft food diet for two months.” Grant Moore, 10 (Emary Skoczlas)",
      "id": 30,
      "date": "1430888400000"
    },
    {
      "img": "media/85.jpg",
      "desc": "“Being in a high school relationship is great, because there is always someone there to constantly support you and the things you do.” Kasie Haemker, 10 (Jada Succes photo)",
      "id": 29,
      "date": "1430802000000"
    },
    {
      "img": "media/86.jpg",
      "desc": "“Next year will be my first year on varsity. I’m nervous because I’ll be a rookie.” Sumi Kirk (Jada Succes photo)",
      "id": 28,
      "date": "1430802000000"
    },
    {
      "img": "media/87.jpg",
      "desc": "“Training is my world. We are a family and when we work with the players, they become our family too.” Anna Jordan, 10 (Jada Succes photo)",
      "id": 27,
      "date": "1430802000000"
    },
    {
      "img": "media/88.jpg",
      "desc": "“I have been selling cookies at the high school since 2005 when my oldest daughter started high school at Summit. I absolutely love seeing the kids at Legacy every Friday. They’re a great group of kids. Its’s a good way to be involved in my kids school and help out the PTA.” Ingrid Skoczlas, PTA volunteer (Emary Skoczlas photo)",
      "id": 26,
      "date": "1430802000000"
    },
    {
      "img": "media/89.jpg",
      "desc": "“Animals are too cool to eat.” Claire Francis, 10 (Emary Skoczlas photo)",
      "id": 25,
      "date": "1430715600000"
    },
    {
      "img": "media/90.jpg",
      "desc": "“Parkour is not about being afraid, it’s about going the distance and just going for it. You don’t know what you are capable of without trying. Jumping and flipping off equipment that is 10 feet in the air is challenging, but it teaches you to be confident in whatever you do.” Dalton Mix, 9 (Allyson Salazar photo)",
      "id": 24,
      "date": "1430370000000"
    },
    {
      "img": "media/91.jpg",
      "desc": "“Half of my closet is cheetah print which makes me the fiercest feline in the jungle.“ Haley Brantley, 12 (Cameron Badolato)",
      "id": 23,
      "date": "1430370000000"
    },
    {
      "img": "media/92.jpg",
      "desc": "“I did theatre because I needed the credit but I really started enjoying it and the people in it. It’s also helped me a lot because I used to be really shy and now I can talk in front of people without shaking or getting nervous.” Adonica Cruz, 11 (Aisha DeBurr photo)",
      "id": 22,
      "date": "1430283600000"
    },
    {
      "img": "media/93.jpg",
      "desc": "“I think this is cool, but I’ve cut open my finger already and I’m not that far along.“ Brooke Bussey, 9 (Tori Greene photo)",
      "id": 21,
      "date": "1430283600000"
    },
    {
      "img": "media/94.jpg",
      "desc": "“If you are wondering what is on my truck it is called Rhino line. I love having a unique truck that no one else has.” Parker Wiley, 10 (Megan Bell photo)",
      "id": 20,
      "date": "1430283600000"
    },
    {
      "img": "media/95.jpg",
      "desc": "“I wanted to put dry ice in the pot before VASE so it would look like the lips at the top were smoking but I didn’t have time. When vase was over Mr. Mason was loading all of pieces into his truck and one of the pieces blew off and took mine with it. The other pot didn’t break but mine did. Mason promised to fix it but he is a liar so…“ Erin Long, 11 (Madison Brown photo)",
      "id": 19,
      "date": "1430283600000"
    },
    {
      "img": "media/96.jpg",
      "desc": "“I don’t really like today’s reality so when I get up on stage I’m substituting reality for my own. I’m basically creating my own world that I can be apart of that is telling the events of the story and I can look out at the audience and I can tell them this story. I can show them this world that we have made.” Samuel Berbel, 12 (Allee Austin photo)",
      "id": 18,
      "date": "1430283600000"
    },
    {
      "img": "media/97.jpg",
      "desc": "“In 7th grade I decided it’d be a good idea to go out and ride my bike in the dark with a dark colored bike, wearing dark clothes. I don’t remember any details but from the police reports I know I was hit on my left side and broke the windshield then rolled off and crack the back of my head open and bruised my brain. I broke my ribs, leg, foot, ankle, and shoulder blade all on my left side I had two major surgeries. One was to put metal plates on my ribs because a piece of the rib came out and punctured my lung like a ballon. My second surgery was to move my stomach back down from my diaphragm. I was in the hospital for about 3 months I even spent Thanksgiving there. Honestly, I am super glad it happened to me because it helped shape who I am as a person today and it helped me learn things about life I never thought I’d know.” Kale Gordon, 11 (Aisha DeBurr photo)",
      "id": 17,
      "date": "1430283600000"
    },
    {
      "img": "media/98.jpg",
      "desc": "“I love the feeling of accomplishment and overcoming something hard. That’s my favorite part about dance.” Anna Roberts, 9 (Madison Brown photo)",
      "id": 16,
      "date": "1430283600000"
    },
    {
      "img": "media/99.jpg",
      "desc": "“One day when I didn’t eat an apple I got sick, so I was like dang I should eat an apple everyday.” Lesley Cruz, 12 (Adriance Rhoades photo)",
      "id": 15,
      "date": "1430283600000"
    },
    {
      "img": "media/100.jpg",
      "desc": "“I thought the grey contacts would be a good change to my boring, black eyes.” Aiman Khan, 11 (Madison Brown photo)",
      "id": 14,
      "date": "1430283600000"
    },
    {
      "img": "media/101.jpg",
      "desc": "“I had a goal to be famous before I was 14. I thought that I would magically become but I had to face reality because I really didn’t have any education or talent.” Carrington Nute, 11 (Aisha DeBurr photo)",
      "id": 13,
      "date": "1430283600000"
    },
    {
      "img": "media/102.jpg",
      "desc": "“There is no one more dedicated than me, you will not find anyone that will put in more work than I do. I am 5'6 receiver, and people don’t expect much from me since I am so small. So I work my butt off to prove to everybody that doubts me that I am becoming the best to ever play football - one step at a time.” Trent McDonald (Brandon Bosecker)",
      "id": 12,
      "date": "1430197200000"
    },
    {
      "img": "media/103.jpg",
      "desc": "“I went to Mansfield High School my freshman year, and I didn’t like it very much. My mom liked the Legacy district lines, so we decided to move. Legacy is more united and family-like. In my opinion, the teachers are better at Legacy and they enforce college a lot more. My parents and I both agree that I’ve improved in school. Now that I moved to Legacy, I’m doing better in school. I made varsity cheer, and I’ve made a lot of new friends.” Savannah Madden, 10 (Amy Gallas photo)",
      "id": 11,
      "date": "1430197200000"
    },
    {
      "img": "media/104.jpg",
      "desc": "“I love swimming, but I hate it. I started swim lessons when I was three. I never stuck my hair in the water because I didn’t want it getting wet. I started summer lessons and competitive swimming in second grade. My sister wanted to be a shamu teacher and I wanted to be just like her. Until seventh grade, I used to be slow compared to everyone else. Then I finally started catching up with everyone else. The past couple years, Ive skyrocketed and went to these crazy meets. It all happened so fast! It’s only fun when you’re actually in a meet. Ive won a total of 52 medals since seventh grade. Im addicted to the pain of swimming. I love working hard when I swim. If I didn’t swim, part of my life would be missing. I’ve put so many hours into it that it’s become my life.” Haley Yelle, 10 (Amy Gallas photo)",
      "id": 10,
      "date": "1430197200000"
    },
    {
      "img": "media/105.jpg",
      "desc": "“Last year, the varsity coach left and got a job at a different school. I didn’t find out until after tryouts when she left, I was offered the job as the varsity coach. I thought it might be hard to coach varsity and also spend time with my kids. Once I took the job, it was hard to do things by myself. I was the only coach for two teams for a while. There was a lot of things I didnt know about because Varsity was so different than JV. I’ve been coaching for 12 years, and it’s very important to me.” Mrs. Watson, Cheer coach (Amy Gallas photo)",
      "id": 9,
      "date": "1430197200000"
    },
    {
      "img": "media/106.jpg",
      "desc": "“I got cut from the basketball team at Legacy and a film class was all that was available. I was in the film class for 2 years. I new I wouldn’t make any money making a career out of it. I was praying to see what God wanted me to do with my life and he told me to go into film. I got a degree at UTA in film and Ive loved every second of it. I got the top film student award at UTA my senior year. I’ve traveled to Turkey three times, Brazil, Coasta Rica, Uganda, for film. Hopefully my future trips include Israel and Nepal. I plan to continue traveling and working for Lumindeo, a new production company.”  Josh Gallas, Legacy graduate (Amy Gallas photo)",
      "id": 8,
      "date": "1430197200000"
    },
    {
      "img": "media/107.jpg",
      "desc": "“Legacy volleyball taught me in order to achieve anything you want in this life you need to work hard at it and that you can’t expect anything to be handed to you and that transfers into what I do after high school in that I work hard to everything I want to achieve, and I now have a 4.0 GPA and am on the track to going to medical school.” Kara Tegze, Legacy graduate (Cameron Badolato photo)",
      "id": 7,
      "date": "1430197200000"
    },
    {
      "img": "media/108.jpg",
      "desc": "“This isn’t even my mask but okay” Taylor Sims, Hailey Cagle and Jessica Newcomb, 9 (Liesl Prater photo)",
      "id": 6,
      "date": "1430197200000"
    },
    {
      "img": "media/109.jpg",
      "desc": "“Since “The Fish bowl” is closed in our voices echo and give them a more dramatic effect.” Rebecca Watson, 10 (Samm Rivers photo)",
      "id": 5,
      "date": "1430197200000"
    },
    {
      "img": "media/110.jpg",
      "desc": "“I’ve gotten hurt every year in some type of way since the seventh grade. This is my 3rd injury this year.” Angelica Luckert, 10 (Sally Swanson photo)",
      "id": 4,
      "date": "1430197200000"
    },
    {
      "img": "media/111.jpg",
      "desc": "“It was my wife’s grandmothers… After she passed, we were cleaning out her home and I found it so I thought I might as well keep it. My dog kept trying to eat it so I brought it up to school and put it in my room.” Shane Skinner, Art teacher (Sally Swanson photo)",
      "id": 3,
      "date": "1430197200000"
    },
    {
      "img": "media/112.jpg",
      "desc": "“I stayed silent for a whole day in protest against LGBT bullying. You never realize how much you talk until you aren’t allowed to.” Madelyne Morris, 11 and Audrey Tomme, 10 (Hannah Morris photo)",
      "id": 2,
      "date": "1430197200000"
    },
    {
      "img": "media/113.jpg",
      "desc": "“I’ve been playing golf for four years. I love playing simply for the peacefulness and calmness of the game. The course is my happy place.” Savannah St. John, 10 (Haleigh Carr photo)",
      "id": 1,
      "date": "1430197200000"
    },
    {
      "img": "media/114.jpg",
      "desc": "“Before I became an iPad technician, I was in school to become an EMT. We started with 35 students at the beginning of the semester. By the end, I was the only one of eight that passed the course and the state certification. I would love to one day continue the program and become a paramedic.” Jessica Retchless, iPad tech  (Cameron Badolato photo)",
      "id": 0,
      "date": "1430197200000"
    }
  ]
}